CSI API ETABS v1
cAreaObj.SetSelectedEdge Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSelectedEdge(
	string Name,
	int EdgeNum,
	bool Selected
)
Function SetSelectedEdge (
	Name As String,
	EdgeNum As Integer,
	Selected As Boolean
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim EdgeNum As Integer
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.SetSelectedEdge(Name,
	EdgeNum, Selected)
int SetSelectedEdge(
	String^ Name,
	int EdgeNum,
	bool Selected
)
abstract SetSelectedEdge :
        Name : string *
        EdgeNum : int *
        Selected : bool -> int
Parameters
Name
Type: System.String
EdgeNum
Type: System.Int32
Selected
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace